---
title: tokenizer
description: docker log
weight: 300
---
# Tokenizer 基本使用


```python
from transformers import AutoTokenizer
```

    d:\pywork\ollama\basic5_torch\prj\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
      from .autonotebook import tqdm as notebook_tqdm
    


```python
sen = "弱小的我也有大夢想!"
```

## Step1 加載與保存


```python
# 從HuggingFace加載，輸入模型名稱，即可加載對於的分詞器
tokenizer = AutoTokenizer.from_pretrained("uer/roberta-base-finetuned-dianping-chinese")
tokenizer
```




    BertTokenizerFast(name_or_path='uer/roberta-base-finetuned-dianping-chinese', vocab_size=21128, model_max_length=1000000000000000019884624838656, is_fast=True, padding_side='right', truncation_side='right', special_tokens={'unk_token': '[UNK]', 'sep_token': '[SEP]', 'pad_token': '[PAD]', 'cls_token': '[CLS]', 'mask_token': '[MASK]'}, clean_up_tokenization_spaces=True),  added_tokens_decoder={
    	0: AddedToken("[PAD]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	100: AddedToken("[UNK]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	101: AddedToken("[CLS]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	102: AddedToken("[SEP]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	103: AddedToken("[MASK]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    }




```python
# tokenizer 保存到本地
tokenizer.save_pretrained("./tmp/roberta_tokenizer")
```




    ('./tmp/roberta_tokenizer\\tokenizer_config.json',
     './tmp/roberta_tokenizer\\special_tokens_map.json',
     './tmp/roberta_tokenizer\\vocab.txt',
     './tmp/roberta_tokenizer\\added_tokens.json',
     './tmp/roberta_tokenizer\\tokenizer.json')




```python
# 從本地加載tokenizer
tokenizer = AutoTokenizer.from_pretrained("./tmp/roberta_tokenizer/")
tokenizer
```




    BertTokenizerFast(name_or_path='./tmp/roberta_tokenizer/', vocab_size=21128, model_max_length=1000000000000000019884624838656, is_fast=True, padding_side='right', truncation_side='right', special_tokens={'unk_token': '[UNK]', 'sep_token': '[SEP]', 'pad_token': '[PAD]', 'cls_token': '[CLS]', 'mask_token': '[MASK]'}, clean_up_tokenization_spaces=True),  added_tokens_decoder={
    	0: AddedToken("[PAD]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	100: AddedToken("[UNK]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	101: AddedToken("[CLS]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	102: AddedToken("[SEP]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    	103: AddedToken("[MASK]", rstrip=False, lstrip=False, single_word=False, normalized=False, special=True),
    }



## Step2 句子分詞


```python
tokens = tokenizer.tokenize(sen)
tokens
```




    ['弱', '小', '的', '我', '也', '有', '大', '夢', '想', '!']



## Step3 查看詞典


```python
tokenizer.vocab
```




    {'##oud': 12867,
     '##序': 15472,
     'ocean': 12546,
     '觐': 6233,
     'language': 8348,
     '##互': 13814,
     '##淀': 16952,
     'pet': 10495,
     '##别': 14223,
     '荳': 5791,
     '##拘': 15929,
     '##綽': 18269,
     '##]': 13341,
     '##dget': 11857,
     '##掃': 16011,
     '嬰': 2087,
     '##刊': 14206,
     '滄': 3993,
     '犢': 4303,
     '酩': 6990,
     '##rc': 10227,
     'panasonic': 10752,
     'java': 8507,
     '刨': 1163,
     '紜': 5161,
     '￥799': 9417,
     '##テ': 11903,
     '##夹': 14988,
     '##蔗': 18972,
     '##申': 17566,
     '淅': 3897,
     'ltxsw': 8793,
     'メーカー': 12052,
     '潼': 4065,
     '##诀': 19451,
     '##鈞': 20104,
     '##怖': 15644,
     '閻': 7291,
     '##า': 13449,
     '##萦': 18910,
     '維': 5204,
     '欒': 3610,
     '1500': 8443,
     '##身': 19773,
     '帥': 2371,
     '深': 3918,
     '1908': 11046,
     '叡': 1364,
     '##⋅': 13552,
     'nhk': 9689,
     '##蕩': 18996,
     '碛': 4816,
     'pu': 11227,
     '##绳': 18391,
     '##邰': 19993,
     '##イフ': 12692,
     'x5': 10871,
     'fi': 8533,
     '##鈺': 20109,
     'glass': 12535,
     '稀': 4921,
     '逊': 6849,
     '蘑': 5982,
     '舖': 5655,
     '铤': 7204,
     '癸': 4631,
     '頹': 7535,
     '##ニア': 12650,
     '##圾': 14826,
     '##钞': 20220,
     '##榕': 16582,
     'dec': 9333,
     'int': 10673,
     '鐺': 7138,
     '##懑': 15806,
     '##ien': 12023,
     'トラックハック': 12766,
     '##hr': 10561,
     '##法': 16848,
     '##なり': 11592,
     'yam': 8107,
     '偵': 980,
     'pe': 9205,
     '##慨': 15774,
     '琵': 4434,
     '##咪': 14545,
     '##悵': 15709,
     '##泮': 16860,
     '##瘙': 17658,
     '凌': 1119,
     '驊': 7706,
     'qualcomm': 13264,
     '絕': 5179,
     '##hing': 10716,
     '##諄': 19368,
     '##遑': 19942,
     '##tive': 9741,
     '##僧': 14071,
     '##状': 17364,
     '##繇': 18306,
     '##蟹': 19158,
     '999': 9098,
     '燈': 4236,
     '宓': 2132,
     '祂': 4855,
     '##奪': 15011,
     'iv': 10573,
     '##鹿': 20979,
     '莽': 5818,
     '##coin': 10160,
     '##itor': 12449,
     '##崁': 15354,
     '##a': 8139,
     '益': 4660,
     '檐': 3592,
     '短': 4764,
     '建': 2456,
     '##錘': 20146,
     'ping': 11891,
     '佟': 871,
     '##磺': 17898,
     '懊': 2747,
     '##笺': 18077,
     '##谨': 19531,
     '##ッフ': 10023,
     'start': 10906,
     '倶': 964,
     '⇒': 375,
     '##匿': 14337,
     '##廈': 15498,
     '##械': 16519,
     '##癢': 17680,
     '##蘼': 19043,
     '570': 11594,
     '汨': 3740,
     'k': 153,
     '##檐': 16649,
     '##秧': 17970,
     '##褪': 19249,
     '##霞': 20516,
     '##low': 10962,
     '乖': 731,
     '##彌': 15550,
     '##箐': 18104,
     '##＝': 12092,
     '晚': 3241,
     '##亚': 13819,
     '钰': 7177,
     '##bo': 8820,
     '詢': 6273,
     '別': 1162,
     '##關': 20359,
     '##桢': 16496,
     'edit': 11150,
     '阔': 7333,
     '尸': 2221,
     '##cher': 10824,
     '##聾': 18539,
     '##痍': 17629,
     '鲍': 7828,
     '睁': 4709,
     '誰': 6306,
     '在': 1762,
     '##捻': 16008,
     '##嚟': 14765,
     '##啮': 14630,
     '##漢': 17088,
     '與': 5645,
     '蜓': 6052,
     '##嫲': 15133,
     '##鑾': 20206,
     'atom': 8941,
     '缈': 5350,
     '##劣': 14276,
     '##∩': 13537,
     '##柒': 16437,
     '##滩': 17070,
     '##陸': 20437,
     '##枉': 16413,
     '彝': 2500,
     '芒': 5695,
     '邻': 6943,
     '頻': 7536,
     '##銅': 20124,
     '##嫁': 15120,
     '1977': 9060,
     '怨': 2596,
     '飼': 7615,
     '##蕴': 19000,
     '##譯': 19415,
     '犯': 4306,
     '韵': 7510,
     '捅': 2927,
     '##氙': 16758,
     'ホ': 623,
     '谦': 6472,
     '##ndy': 11373,
     '養': 7621,
     'seo': 8475,
     '##口': 14423,
     '##nos': 12782,
     '##褔': 19246,
     '##信': 13985,
     '344': 12698,
     '礦': 4846,
     '##on': 8224,
     '蹦': 6698,
     '呋': 1441,
     'fun': 9575,
     '毆': 3676,
     '##卒': 14350,
     '1924': 10052,
     '##明': 16266,
     'i': 151,
     '##檔': 16650,
     'read': 8649,
     '濟': 4089,
     '特': 4294,
     '##ゆ': 13676,
     '##嗎': 14678,
     '##曠': 16342,
     '鈞': 7047,
     '薈': 5949,
     '##效': 16183,
     '##ond': 11684,
     '##审': 15201,
     '##虫': 19058,
     '##对': 15247,
     '##vis': 11233,
     'smap': 13175,
     '宿': 2162,
     '覧': 6216,
     '币': 2355,
     '##比': 16740,
     '陲': 7375,
     '##觉': 19287,
     '##w': 8220,
     '##動': 14297,
     '##唸': 14608,
     '##衞': 19186,
     '2400': 9851,
     '##栋': 16463,
     '##部': 20013,
     '祈': 4857,
     '##95': 9102,
     '##胄': 18575,
     'name': 8617,
     '偈': 970,
     '##莲': 18870,
     '##保': 13981,
     '邏': 6922,
     '镕': 7258,
     '闖': 7300,
     '405': 11982,
     '##凸': 14194,
     'いお': 11481,
     '##敦': 16199,
     '##迷': 19894,
     '爸': 4268,
     '镌': 7254,
     '沾': 3783,
     '鱷': 7822,
     'step': 9451,
     'gr2': 9293,
     '铀': 7187,
     '##ward': 11612,
     '##蹩': 19756,
     '払': 2804,
     'review': 9950,
     '鉀': 7054,
     '166': 9771,
     '##50': 8474,
     '並': 699,
     '憔': 2732,
     '掘': 2963,
     '竽': 5003,
     'dos': 10441,
     '##紋': 18208,
     '##懵': 15810,
     '复': 1908,
     '##恺': 15685,
     '##蓼': 18967,
     '##侑': 13951,
     '庐': 2416,
     '##帧': 15430,
     '##back': 10102,
     'en': 9447,
     'vera': 9378,
     '6': 127,
     'planet': 12269,
     '1999': 8338,
     'files': 10463,
     '##蛟': 19091,
     '##飯': 20670,
     '##蜗': 19111,
     '##睹': 17783,
     '1913': 10432,
     '啱': 1575,
     '9985': 12839,
     '＋': 8023,
     '##昉': 16263,
     '##钛': 20217,
     '洁': 3815,
     '栈': 3404,
     '##镛': 20318,
     'jan': 9213,
     '弟': 2475,
     '谀': 6442,
     'a7': 11226,
     '黒': 7947,
     '銖': 7070,
     '##挣': 15971,
     '##ner': 8957,
     '沛': 3764,
     '##梯': 16518,
     '##蓆': 18956,
     '215': 10082,
     '树': 3409,
     '惧': 2672,
     '県': 4693,
     '##銃': 20123,
     '谎': 6453,
     '##禹': 17950,
     '305': 10849,
     '收': 3119,
     '醃': 7002,
     '##f': 8189,
     '凳': 1135,
     '蔫': 5921,
     '324': 11500,
     '##跡': 19714,
     '##盜': 17728,
     '414': 12815,
     '##倘': 14008,
     '##﹕': 21061,
     'eclipse': 11752,
     'uhz': 11599,
     '豈': 6488,
     '頭': 7531,
     '弘': 2473,
     'jayz': 11072,
     '俐': 919,
     'insee': 11513,
     '##広': 15467,
     '##吸': 14486,
     '##杉': 16386,
     'tips': 9104,
     '##磯': 17895,
     '厌': 1328,
     '##佩': 13934,
     '2000': 8202,
     '820': 10398,
     'ib': 12487,
     'ね': 560,
     '搬': 3021,
     'other': 12132,
     '##呵': 14514,
     '数': 3144,
     '##啵': 14634,
     '20℃': 12926,
     '##諺': 19386,
     '劫': 1223,
     '##cs': 9761,
     '楨': 3509,
     '熙': 4224,
     '##駆': 20744,
     '##放': 16180,
     '##戀': 15818,
     '叉': 1349,
     '诡': 6417,
     '諭': 6323,
     '##ita': 10242,
     '哇': 1505,
     '滦': 4011,
     'sc': 11515,
     'د': 265,
     '##讫': 19434,
     '蚯': 6021,
     '##深': 16975,
     '##time': 9785,
     '钦': 7171,
     '##傻': 14061,
     '##耿': 18518,
     '##饑': 20697,
     '##紙': 18215,
     '滔': 4000,
     '##葆': 18920,
     '##骊': 20796,
     '褂': 6184,
     '##延': 15511,
     '##没': 16823,
     '崗': 2305,
     '##宥': 15205,
     '##°c': 9953,
     '摸': 3043,
     'editor': 11544,
     'かかります': 9791,
     '##蔓': 18970,
     '银': 7213,
     '##槿': 16611,
     '##lone': 12519,
     '刈': 1148,
     '##享': 13832,
     '芎': 5694,
     '##唁': 14589,
     '##權': 16666,
     '[unused77]': 77,
     '暌': 3262,
     '狀': 4311,
     '##姐': 15052,
     '皓': 4645,
     '英': 5739,
     '##價': 14076,
     '##傢': 14050,
     '##經': 18252,
     '##６': 9234,
     '医': 1278,
     '溯': 3985,
     '窯': 4982,
     '笛': 5013,
     '蒜': 5886,
     '##硯': 17860,
     '##劍': 14267,
     '{': 169,
     '歓': 3628,
     'williams': 11475,
     '涉': 3868,
     '･': 8085,
     '捧': 2942,
     '値': 957,
     '枸': 3375,
     '丛': 690,
     '溴': 3987,
     '┌': 434,
     '1981': 8785,
     '##喘': 14653,
     '##屆': 15291,
     '##绻': 18397,
     '##谈': 19505,
     '##ia': 8321,
     'ios10': 10671,
     '##oz': 13102,
     '与': 680,
     '曲': 3289,
     '##繭': 18316,
     '憲': 2740,
     '鏤': 7130,
     '畿': 4537,
     '##缽': 18433,
     '啪': 1570,
     '瞌': 4734,
     '1978': 8774,
     'ス': 605,
     '##っています': 11822,
     '碎': 4810,
     '竊': 4988,
     '肪': 5505,
     '4a': 10660,
     '萘': 5849,
     '籠': 5096,
     '##鑣': 20200,
     '##睑': 17770,
     '##鍊': 20158,
     '##氷': 16775,
     '##倫': 14018,
     '##款': 16678,
     'lte': 8987,
     '频': 7574,
     '##ρ': 13394,
     '499': 9927,
     '从': 794,
     '##空': 18015,
     '腭': 5585,
     '##点': 17214,
     '2018': 8271,
     'content': 9432,
     '般': 5663,
     '##sue': 11872,
     '##脫': 18619,
     '##頑': 20579,
     '01': 8146,
     '垫': 1807,
     '2m': 10725,
     '伺': 848,
     '好': 1962,
     '##鈍': 20100,
     '##▪': 13607,
     '##谘': 19519,
     'ｗ': 8073,
     '##婚': 15099,
     '##come': 12097,
     '##疏': 17598,
     '蜻': 6064,
     '##藍': 19022,
     '##到': 14225,
     '##针': 20208,
     '##oo': 8902,
     '##杵': 16405,
     '唏': 1537,
     '403': 12058,
     '##逞': 19918,
     '汉': 3727,
     '薊': 5950,
     '##望': 16364,
     '柔': 3382,
     '街': 6125,
     '##躪': 19772,
     '##溉': 17030,
     '##夫': 14980,
     '##煜': 17264,
     'so': 8968,
     '淦': 3911,
     '##礫': 17905,
     '懋': 2748,
     '鹂': 7897,
     '##魯': 20855,
     '##涼': 16950,
     '荟': 5780,
     '萃': 5842,
     '##铐': 20253,
     '挝': 2909,
     '##曄': 16334,
     '##哂': 14559,
     '##芾': 18773,
     '##ˇ': 13371,
     '##ise': 9651,
     '##琮': 17486,
     '##驛': 20769,
     '##罗': 18441,
     '224': 10629,
     '4600': 8826,
     '##疼': 17620,
     '384': 12344,
     '亀': 747,
     '卅': 1284,
     '##logy': 11121,
     '##習': 18481,
     '牴': 4292,
     '缅': 5347,
     '##刮': 14224,
     '##傥': 14052,
     '##宙': 15193,
     '##瑗': 17500,
     '##纫': 18337,
     '##鈴': 20108,
     '##腦': 18639,
     '##稠': 17989,
     'h5': 9354,
     '瀑': 4105,
     '##銑': 20125,
     '犍': 4301,
     '##酯': 20051,
     '瘁': 4596,
     '##爱': 17320,
     '縷': 5243,
     '##钠': 20222,
     '郜': 6949,
     'oct': 9346,
     '##尾': 15284,
     '##靛': 20533,
     '##饺': 20716,
     '吒': 1404,
     '##蹶': 19761,
     '##怙': 15645,
     'hbl': 12502,
     '迅': 6813,
     '趨': 6638,
     '##view': 8892,
     '##漪': 17091,
     '>': 135,
     '##ｂ': 12641,
     'dx': 13240,
     '烹': 4181,
     '澜': 4073,
     '鍛': 7104,
     '銓': 7069,
     '##隴': 20461,
     '晃': 3230,
     '##pods': 13284,
     '##異': 17587,
     '##椹': 16554,
     '@': 137,
     '##rite': 11366,
     '##话': 19470,
     'matt': 12042,
     '##board': 9472,
     '绶': 5337,
     '##и': 11000,
     '##咤': 14540,
     '铆': 7193,
     '杳': 3347,
     '##孿': 15179,
     '23': 8133,
     '##伽': 13907,
     '##0m': 13079,
     '##来': 16398,
     '擂': 3076,
     '##跳': 19720,
     '夸': 1930,
     '纳': 5287,
     '##陪': 20430,
     '##iti': 12644,
     '##薑': 19009,
     '##鮪': 20859,
     'william': 9979,
     '羁': 5396,
     '##桐': 16489,
     '##烛': 17226,
     '[unused41]': 41,
     '操': 3082,
     '##物': 17346,
     '##胶': 18597,
     'mi': 10551,
     're': 8847,
     'ᵃ': 330,
     '##蹋': 19748,
     '夢': 1918,
     '##hu': 9670,
     '##槛': 16603,
     '##狮': 17383,
     'audi': 9976,
     '械': 3462,
     '沓': 3761,
     '廝': 2447,
     '葆': 5863,
     '迭': 6834,
     '弩': 2480,
     '##lux': 12700,
     '##郧': 20012,
     '##挲': 15978,
     '証': 6264,
     'lifestyle': 12996,
     '鳍': 7846,
     '##處': 19050,
     '﹂': 7997,
     'vcd': 10280,
     '##侯': 13965,
     '潋': 4046,
     '##孳': 15174,
     '撈': 3051,
     'pizza': 10315,
     '；': 8039,
     '得': 2533,
     '嚨': 1711,
     '##♡': 13627,
     '##聯': 18531,
     '##痨': 17642,
     '##計': 19300,
     '▋': 455,
     '谒': 6457,
     '##齡': 21029,
     '袋': 6150,
     '##冬': 14157,
     '##唱': 14605,
     '##瀆': 17158,
     'audio': 11698,
     '╞': 441,
     'gdp': 8421,
     '##cal': 10384,
     'self': 12178,
     '##菁': 18878,
     '##ti': 9007,
     '##監': 17732,
     '##谁': 19500,
     '经': 5307,
     'its': 12894,
     '##湛': 17018,
     '##吉': 14452,
     'water': 11060,
     '箭': 5055,
     '嫌': 2066,
     '酿': 7001,
     '讞': 6368,
     '[unused15]': 15,
     '##lee': 12448,
     '##52': 9364,
     '##谣': 19526,
     '冽': 1110,
     '悸': 2654,
     '##泛': 16850,
     '##file': 12056,
     'sbl': 12250,
     '306': 10576,
     '37': 8234,
     '##忍': 15613,
     '##須': 20576,
     'idc': 9617,
     'ツ': 611,
     'miss': 9368,
     'sbs': 9965,
     '##重': 20085,
     '##∶': 13539,
     '橙': 3581,
     '捡': 2939,
     '瞎': 4735,
     '蛭': 6036,
     '##渉': 16985,
     '##率': 17429,
     '##約': 18204,
     'tower': 11102,
     '##竿': 18061,
     '##瓒': 17534,
     '1941': 9327,
     '26': 8153,
     '嬛': 2083,
     'hd': 8407,
     '帖': 2365,
     '撤': 3059,
     '##儘': 14086,
     '##峴': 15350,
     '##枷': 16431,
     '[unused75]': 75,
     '##憫': 15795,
     '##瘫': 17668,
     '##烊': 17222,
     'event': 10992,
     '廁': 2438,
     'ます': 11105,
     '##娅': 15074,
     '狱': 4328,
     '##培': 14881,
     '茯': 5758,
     '貓': 6506,
     '锥': 7238,
     '镖': 7259,
     '##哭': 14583,
     '##烙': 17225,
     '##なりました': 12533,
     '##竊': 18045,
     '##妓': 15029,
     '##鯨': 20866,
     '298': 10690,
     'ep': 10676,
     '螳': 6089,
     'cell': 11490,
     '##纾': 18352,
     '讲': 6382,
     '唾': 1552,
     '涼': 3893,
     'ofo': 9574,
     '##黜': 21008,
     '##助': 14278,
     '##✈': 13632,
     '##列': 14211,
     '##14': 8717,
     '##畑': 17577,
     '界': 4518,
     '痼': 4593,
     'joseph': 11151,
     '堰': 1840,
     '剥': 1195,
     '歳': 3642,
     '聂': 5462,
     '##┃': 13579,
     '##湊': 17014,
     '##躋': 19769,
     '[unused9]': 9,
     'number': 11333,
     '槻': 3552,
     '鲢': 7833,
     '##エ': 13682,
     '##厌': 14385,
     '嗡': 1631,
     '俨': 929,
     '##荠': 18838,
     '##夕': 14968,
     'singapore': 12916,
     '嬿': 2091,
     '庚': 2423,
     '343': 12186,
     '##終': 18230,
     '##啓': 14616,
     'ㄛ': 658,
     '##虬': 19059,
     '##怪': 15654,
     '##层': 15288,
     'ddd': 13234,
     '痧': 4584,
     '盧': 4678,
     '韧': 7505,
     '犁': 4298,
     '溏': 3974,
     '##す': 8764,
     '蜥': 6060,
     '袱': 6160,
     '##rip': 12332,
     '200': 8185,
     '##滴': 17074,
     '[unused99]': 99,
     '塞': 1853,
     '桶': 3446,
     '訪': 6256,
     '賃': 6534,
     '##节': 18745,
     '汩': 3741,
     '##个': 13759,
     '丽': 714,
     '盔': 4666,
     '隈': 7385,
     '賺': 6553,
     'county': 13088,
     '帛': 2368,
     '斐': 3156,
     '猿': 4351,
     '##围': 14798,
     '##鉴': 20120,
     '谅': 6446,
     '閲': 7289,
     '##臻': 18695,
     '##lon': 10146,
     '##処': 14186,
     '獸': 4366,
     '##nne': 12866,
     '石': 4767,
     '聆': 5463,
     '蠣': 6112,
     '袁': 6145,
     'views': 9881,
     '拦': 2882,
     '紘': 5157,
     '##rma': 13156,
     '##例': 13948,
     '##襯': 19260,
     '##炜': 17205,
     '##憤': 15791,
     '##櫛': 16661,
     '##敝': 16195,
     'mode': 10770,
     '##贵': 19643,
     '##饷': 20715,
     '##鞘': 20551,
     '##」': 13655,
     '##72': 9492,
     'sql': 9078,
     '##tm': 10774,
     'ssd': 9004,
     '拧': 2883,
     '艱': 5681,
     '##魚': 20854,
     '又': 1348,
     '丿': 716,
     '║': 439,
     '1950': 8707,
     '##佼': 13942,
     '##蝟': 19131,
     '##赐': 19663,
     '奖': 1946,
     '瓴': 4485,
     '阚': 7337,
     '革': 7484,
     '｜': 8078,
     'book': 9106,
     'capital': 10715,
     'instagram': 8780,
     'wwdc': 12848,
     '337': 12129,
     '鑑': 7141,
     '##嗖': 14683,
     '暗': 3266,
     '##over': 11436,
     '殡': 3661,
     '##午': 14343,
     '##狙': 17376,
     '##綢': 18257,
     '##颤': 20645,
     '##瑛': 17503,
     '##eep': 12293,
     '##▌': 13603,
     '##篡': 18127,
     'good': 9005,
     '##冥': 14154,
     'life': 8562,
     'いを': 12029,
     'ならワークケートへ': 12154,
     '##姬': 15067,
     '##у': 13418,
     '僱': 1017,
     '植': 3490,
     'sean': 12794,
     '霊': 7451,
     '##匀': 14315,
     '珈': 4394,
     '腳': 5589,
     'oldid': 13267,
     '[unused49]': 49,
     '##鶘': 20928,
     '##添': 16981,
     '虞': 5997,
     '##〇': 13649,
     '##蟲': 19157,
     '咫': 1489,
     '##腔': 18636,
     'pinkoi': 11941,
     '##ura': 10238,
     '##vy': 11853,
     '##币': 15412,
     '##质': 19631,
     'q4': 11625,
     '瓢': 4479,
     '##za': 9283,
     '##嚷': 14771,
     '窦': 4977,
     '##攫': 16173,
     'esc': 9307,
     '這': 6857,
     '##铄': 20248,
     '鸾': 7895,
     '##彆': 15548,
     '##code': 10802,
     'にお': 10768,
     '邱': 6937,
     '##71': 9097,
     'eeworld': 12490,
     '于': 754,
     '515': 13196,
     '##mate': 12125,
     '##紐': 18210,
     '坤': 1787,
     '⒉': 421,
     '痙': 4577,
     '##诩': 19481,
     '##靥': 20539,
     '搜': 3017,
     'huang': 10788,
     '##预': 20621,
     '軾': 6732,
     '##汀': 16779,
     '##汇': 16783,
     'cache': 10991,
     '埗': 1817,
     '癢': 4623,
     'avi': 10548,
     '惆': 2659,
     'ssh': 11678,
     'blue': 9036,
     'netflix': 10373,
     '##婀': 15093,
     '沦': 3770,
     'せ': 549,
     '恻': 2629,
     '旷': 3199,
     '烯': 4179,
     '泾': 3814,
     'avira': 10473,
     '##煮': 17272,
     '##純': 18212,
     '跃': 6645,
     '##秤': 17968,
     '纱': 5285,
     'gm': 12277,
     'claire': 9753,
     'false': 11457,
     'tc': 12858,
     'ｏｋ': 11518,
     'さんも': 11835,
     '##ger': 9289,
     '襲': 6204,
     '##条': 16397,
     'mozilla': 11579,
     '珺': 4411,
     '姊': 1992,
     'research': 10018,
     '浯': 3860,
     '羲': 5414,
     '蠅': 6104,
     'ie': 8469,
     '##登': 17690,
     '扱': 2818,
     'how': 9510,
     'kong': 8906,
     '库': 2417,
     '1982': 8687,
     '離': 7431,
     'change': 12319,
     '##皂': 17694,
     '##蛮': 19094,
     'rna': 11656,
     'spark': 11134,
     '缤': 5364,
     '##洼': 16891,
     '•': 340,
     '##郴': 20016,
     '届': 2237,
     '箍': 5045,
     '##χ': 13400,
     'know': 11460,
     '徘': 2534,
     '⑥': 410,
     '年': 2399,
     '##麽': 20996,
     '##鑽': 20205,
     '绚': 5315,
     '##tty': 11160,
     '##钻': 20240,
     '##ral': 10482,
     'call': 9816,
     '瑟': 4449,
     '翠': 5428,
     '拓': 2868,
     '荆': 5769,
     ...}




```python
tokenizer.vocab_size
```




    21128



## Step4 索引轉換


```python
# 將詞序列轉換為id序列
ids = tokenizer.convert_tokens_to_ids(tokens)
ids
```




    [2483, 2207, 4638, 2769, 738, 3300, 1920, 1918, 2682, 106]




```python
# 將id序列轉換為token序列
tokens = tokenizer.convert_ids_to_tokens(ids)
tokens
```


```python
# 將token序列轉換為string
str_sen = tokenizer.convert_tokens_to_string(tokens)
str_sen
```

###  更便捷的實現方式


```python
# 將字符串轉換為id序列，又稱之為編碼
ids = tokenizer.encode(sen, add_special_tokens=True)
ids
```




    [101, 2483, 2207, 4638, 2769, 738, 3300, 1920, 1918, 2682, 106, 102]




```python
# 將id序列轉換為字符串，又稱之為解碼
str_sen = tokenizer.decode(ids, skip_special_tokens=False)
str_sen
```

## Step5 填充與截斷


```python
# 填充
ids = tokenizer.encode(sen, padding="max_length", max_length=15)
ids
```


```python
# 截斷
ids = tokenizer.encode(sen, max_length=5, truncation=True)
ids
```

## Step6 其他輸入部分


```python
ids = tokenizer.encode(sen, padding="max_length", max_length=15)
ids
```


```python
attention_mask = [1 if idx != 0 else 0 for idx in ids]
token_type_ids = [0] * len(ids)
ids, attention_mask, token_type_ids
```

## Step7 快速調用方式


```python
inputs = tokenizer.encode_plus(sen, padding="max_length", max_length=15)
inputs
```


```python
inputs = tokenizer(sen, padding="max_length", max_length=15)
inputs
```

## Step8 處理batch數據


```python
sens = ["弱小的我也有大夢想",
        "有夢想誰都了不起",
        "追逐夢想的心，比夢想本身，更可貴"]
res = tokenizer(sens)
res
```


```python
%%time
# 單條循環處理
for i in range(1000):
    tokenizer(sen)
```


```python
%%time
# 處理batch數據
res = tokenizer([sen] * 1000)
```


```python
tokenizer
```

# Fast / Slow Tokenizer


```python
sen = "弱小的我也有大Dreaming!"
```


```python
fast_tokenizer = AutoTokenizer.from_pretrained("uer/roberta-base-finetuned-dianping-chinese")
fast_tokenizer
```


```python
slow_tokenizer = AutoTokenizer.from_pretrained("uer/roberta-base-finetuned-dianping-chinese", use_fast=False)
slow_tokenizer
```


```python
%%time
# 單條循環處理
for i in range(10000):
    fast_tokenizer(sen)
```


```python
%%time
# 單條循環處理
for i in range(10000):
    slow_tokenizer(sen)
```


```python
%%time
# 處理batch數據
res = fast_tokenizer([sen] * 10000)
```


```python
%%time
# 處理batch數據
res = slow_tokenizer([sen] * 10000)
```


```python
inputs = fast_tokenizer(sen, return_offsets_mapping=True)
inputs
```


```python
inputs.word_ids()
```


```python
inputs = slow_tokenizer(sen, return_offsets_mapping=True)
```

# 特殊Tokenizer的加載


```python
from transformers import AutoTokenizer
```


```python
# 新版本的transformers（>4.34），加載 THUDM/chatglm 會報錯，因此這裡替換為了天宮的模型
tokenizer = AutoTokenizer.from_pretrained("Skywork/Skywork-13B-base", trust_remote_code=True)
tokenizer
```


```python
tokenizer.save_pretrained("skywork_tokenizer")
```


```python
tokenizer = AutoTokenizer.from_pretrained("skywork_tokenizer", trust_remote_code=True)
```


```python
tokenizer.decode(tokenizer.encode(sen))
```


```python

```
