---
title: concept_term
description: docker log
weight: 300
---
[來自](https://github.com/duonghuuphuc/keras)
在keras中Dense 是神經層的意思 

![](../resource/concept_term_1.png)


```python
#https://github.com/duonghuuphuc/keras/blob/master/dataset/pima-indians-diabetes.csv
#"https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
# create first network with Keras
from keras.models import Sequential
from keras.layers import Dense
import numpy
import pandas as pd


# fix random seed for reproducibility
seed = 7
numpy.random.seed(seed)


# load pima indians dataset
#dataset = numpy.loadtxt("pima-indians-diabetes.csv", delimiter=",")
url = "https://raw.githubusercontent.com/duonghuuphuc/keras/refs/heads/master/dataset/pima-indians-diabetes.csv"
tmp = pd.read_csv(url)
dataset=tmp.to_numpy()

X = dataset[:,0:8]
Y = dataset[:,8]


# create model
model = Sequential()

model.add(Dense(12, input_dim=8, kernel_initializer='uniform', activation='relu')) #第一個隱藏層12個神經元,輸入有8個欄位
model.add(Dense(8, kernel_initializer='uniform', activation='relu'))  # 第二個隱藏層有8個神經元
model.add(Dense(1, kernel_initializer='uniform', activation='sigmoid')) #最後一個輸出有1個神經元
 
# compile model
model.compile(loss='binary_crossentropy' , optimizer='adam', metrics=['accuracy'])

# input the dataset into created model
model.fit(X, Y, epochs=150, batch_size=10)

# evaluate the model
scores = model.evaluate(X, Y)
print("%s: %.2f%%" % (model.metrics_names[1], scores[1]*100)) 
```

    Epoch 1/150
    

    c:\Users\linchao\AppData\Local\Programs\Python\Python312\Lib\site-packages\keras\src\layers\core\dense.py:87: UserWarning: Do not pass an `input_shape`/`input_dim` argument to a layer. When using Sequential models, prefer using an `Input(shape)` object as the first layer in the model instead.
      super().__init__(activity_regularizer=activity_regularizer, **kwargs)
    

    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m1s[0m 2ms/step - accuracy: 0.5868 - loss: 0.6856
    Epoch 2/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6484 - loss: 0.6654  
    Epoch 3/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6616 - loss: 0.6516 
    Epoch 4/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6765 - loss: 0.6377
    Epoch 5/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.6680 - loss: 0.6224
    Epoch 6/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6933 - loss: 0.6109
    Epoch 7/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6792 - loss: 0.6166 
    Epoch 8/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.6765 - loss: 0.6119
    Epoch 9/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6973 - loss: 0.5982
    Epoch 10/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6876 - loss: 0.5895
    Epoch 11/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7159 - loss: 0.5900
    Epoch 12/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 906us/step - accuracy: 0.6691 - loss: 0.5822
    Epoch 13/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7123 - loss: 0.5682
    Epoch 14/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7047 - loss: 0.5655
    Epoch 15/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7126 - loss: 0.5849 
    Epoch 16/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 802us/step - accuracy: 0.6988 - loss: 0.5827
    Epoch 17/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7162 - loss: 0.5726
    Epoch 18/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7140 - loss: 0.5742
    Epoch 19/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7108 - loss: 0.5775  
    Epoch 20/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.6831 - loss: 0.5829
    Epoch 21/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7056 - loss: 0.5699
    Epoch 22/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7165 - loss: 0.5734
    Epoch 23/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7373 - loss: 0.5559
    Epoch 24/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7038 - loss: 0.5617
    Epoch 25/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.6987 - loss: 0.5565
    Epoch 26/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7411 - loss: 0.5458
    Epoch 27/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7369 - loss: 0.5298
    Epoch 28/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7080 - loss: 0.5986
    Epoch 29/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 3ms/step - accuracy: 0.7191 - loss: 0.5606
    Epoch 30/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7131 - loss: 0.5717
    Epoch 31/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7261 - loss: 0.5392
    Epoch 32/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7500 - loss: 0.5410
    Epoch 33/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7393 - loss: 0.5426
    Epoch 34/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7161 - loss: 0.5659
    Epoch 35/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7696 - loss: 0.5129  
    Epoch 36/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7571 - loss: 0.5366
    Epoch 37/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 3ms/step - accuracy: 0.7136 - loss: 0.5619
    Epoch 38/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7424 - loss: 0.5361
    Epoch 39/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7525 - loss: 0.5148
    Epoch 40/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7280 - loss: 0.5548
    Epoch 41/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7479 - loss: 0.5410
    Epoch 42/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7262 - loss: 0.5515
    Epoch 43/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 955us/step - accuracy: 0.7355 - loss: 0.5419
    Epoch 44/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 959us/step - accuracy: 0.7450 - loss: 0.5151
    Epoch 45/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7328 - loss: 0.5604
    Epoch 46/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7804 - loss: 0.4941
    Epoch 47/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7448 - loss: 0.5298
    Epoch 48/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7437 - loss: 0.5279
    Epoch 49/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7210 - loss: 0.5412
    Epoch 50/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7377 - loss: 0.5177
    Epoch 51/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7446 - loss: 0.5346
    Epoch 52/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7306 - loss: 0.5446
    Epoch 53/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7326 - loss: 0.5231
    Epoch 54/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7487 - loss: 0.5187
    Epoch 55/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7475 - loss: 0.5146
    Epoch 56/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7603 - loss: 0.5205
    Epoch 57/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7742 - loss: 0.4989
    Epoch 58/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7586 - loss: 0.5225
    Epoch 59/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7294 - loss: 0.5231
    Epoch 60/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7257 - loss: 0.5152
    Epoch 61/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 954us/step - accuracy: 0.7493 - loss: 0.5149
    Epoch 62/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7489 - loss: 0.5247
    Epoch 63/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7438 - loss: 0.5281
    Epoch 64/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7494 - loss: 0.5070 
    Epoch 65/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7502 - loss: 0.5067
    Epoch 66/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7594 - loss: 0.5082
    Epoch 67/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7521 - loss: 0.5106
    Epoch 68/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7768 - loss: 0.4908
    Epoch 69/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7746 - loss: 0.4858 
    Epoch 70/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7425 - loss: 0.5089
    Epoch 71/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7838 - loss: 0.4941
    Epoch 72/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7598 - loss: 0.4969
    Epoch 73/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7430 - loss: 0.5056
    Epoch 74/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7602 - loss: 0.4950  
    Epoch 75/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7642 - loss: 0.4899  
    Epoch 76/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7625 - loss: 0.4905
    Epoch 77/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7457 - loss: 0.5164
    Epoch 78/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7665 - loss: 0.4948
    Epoch 79/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7489 - loss: 0.4939  
    Epoch 80/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7449 - loss: 0.5005
    Epoch 81/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7846 - loss: 0.4722 
    Epoch 82/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7697 - loss: 0.4921
    Epoch 83/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7995 - loss: 0.4560
    Epoch 84/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7736 - loss: 0.4907
    Epoch 85/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7514 - loss: 0.5255
    Epoch 86/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 947us/step - accuracy: 0.7590 - loss: 0.5126
    Epoch 87/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7845 - loss: 0.4920
    Epoch 88/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7638 - loss: 0.4702
    Epoch 89/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 3ms/step - accuracy: 0.7855 - loss: 0.4715
    Epoch 90/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7659 - loss: 0.4926 
    Epoch 91/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7332 - loss: 0.5139
    Epoch 92/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7703 - loss: 0.4748
    Epoch 93/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7680 - loss: 0.4685
    Epoch 94/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7797 - loss: 0.4684
    Epoch 95/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7806 - loss: 0.4637
    Epoch 96/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7598 - loss: 0.4880
    Epoch 97/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7890 - loss: 0.4550
    Epoch 98/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7731 - loss: 0.5085
    Epoch 99/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7884 - loss: 0.4799
    Epoch 100/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 967us/step - accuracy: 0.7769 - loss: 0.4746
    Epoch 101/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7633 - loss: 0.4825
    Epoch 102/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7774 - loss: 0.4751
    Epoch 103/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7609 - loss: 0.4954
    Epoch 104/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7935 - loss: 0.4519
    Epoch 105/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7801 - loss: 0.4680
    Epoch 106/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7545 - loss: 0.4875
    Epoch 107/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7526 - loss: 0.4697
    Epoch 108/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7595 - loss: 0.4894  
    Epoch 109/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7495 - loss: 0.4898  
    Epoch 110/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7914 - loss: 0.4301
    Epoch 111/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7715 - loss: 0.4564
    Epoch 112/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7524 - loss: 0.4694
    Epoch 113/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 3ms/step - accuracy: 0.7853 - loss: 0.4611 
    Epoch 114/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7501 - loss: 0.4899
    Epoch 115/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.8126 - loss: 0.4338
    Epoch 116/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7723 - loss: 0.4576
    Epoch 117/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7971 - loss: 0.4335
    Epoch 118/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7904 - loss: 0.4424
    Epoch 119/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7825 - loss: 0.4717
    Epoch 120/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7712 - loss: 0.4787 
    Epoch 121/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7746 - loss: 0.4589  
    Epoch 122/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7844 - loss: 0.4690
    Epoch 123/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.8105 - loss: 0.4263
    Epoch 124/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.8150 - loss: 0.4373
    Epoch 125/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7645 - loss: 0.4925
    Epoch 126/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.8140 - loss: 0.4282
    Epoch 127/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7765 - loss: 0.4668
    Epoch 128/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7876 - loss: 0.4564
    Epoch 129/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7914 - loss: 0.4717
    Epoch 130/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 4ms/step - accuracy: 0.7644 - loss: 0.4774
    Epoch 131/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7894 - loss: 0.4503  
    Epoch 132/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7814 - loss: 0.4629
    Epoch 133/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7746 - loss: 0.4904
    Epoch 134/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7729 - loss: 0.4902
    Epoch 135/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7818 - loss: 0.4531
    Epoch 136/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7678 - loss: 0.4668
    Epoch 137/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7980 - loss: 0.4569
    Epoch 138/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7670 - loss: 0.4520 
    Epoch 139/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7616 - loss: 0.4748
    Epoch 140/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.8002 - loss: 0.4428
    Epoch 141/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7878 - loss: 0.4457
    Epoch 142/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7752 - loss: 0.4630
    Epoch 143/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7821 - loss: 0.4377
    Epoch 144/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7889 - loss: 0.4436
    Epoch 145/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7827 - loss: 0.4439
    Epoch 146/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7827 - loss: 0.4624
    Epoch 147/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7651 - loss: 0.4651
    Epoch 148/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 2ms/step - accuracy: 0.7831 - loss: 0.4401
    Epoch 149/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7810 - loss: 0.4512
    Epoch 150/150
    [1m77/77[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 1ms/step - accuracy: 0.7676 - loss: 0.4440
    [1m24/24[0m [32m━━━━━━━━━━━━━━━━━━━━[0m[37m[0m [1m0s[0m 653us/step - accuracy: 0.7550 - loss: 0.4844
    compile_metrics: 79.27%
    
